fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбоненскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// ++ Начало.Квитко 08.09.25
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание Тогда
		ВКМ_РаботаСФормойСервер.ДополнениеФормы(ЭтотОбъект);
	КонецЕсли;
	// -- Конец.Квитко 08.09.25
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаСервере
Процедура ВидДоговораПриИзмененииНаСервере()
	
	// ++ Начало.Квитко 08.09.25
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание Тогда 
		ВКМ_РаботаСФормойСервер.ДополнениеФормы(ЭтотОбъект);
	Иначе
		
		Если Элементы.Найти("ГруппаПериод") <> Неопределено Тогда
			Элементы.Удалить(Элементы.ГруппаПериод);
			Объект.ВКМ_ДатаНачалаДействия = Дата(1, 1, 1);
			Объект.ВКМ_ДатаОкончанияДействия = Дата(1, 1, 1);
		КонецЕсли;
				
		Если Элементы.Найти("ГруппаРасчет") <> Неопределено Тогда
			Элементы.Удалить(Элементы.ГруппаРасчет);
			Объект.ВКМ_СуммаАбонентскойПлаты = 0;
			Объект.ВКМ_СтоимостьЧасаРаботы = 0;
		КонецЕсли;
				
	КонецЕсли;
	// -- Конец.Квитко 08.09.25	
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	// ++ Начало.Квитко 08.09.25
	ВидДоговораПриИзмененииНаСервере(); 
	// -- Конец.Квитко 08.09.25	
	
КонецПроцедуры

#КонецОбласти
